app/Controllers/Home.php

    public function login()
    {
        // inputan dari form login
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // melakukan verifikasi database user berdasarkan username
        $user = $this->UsersModel->where('username', $username)->first();
---
SELECT *
FROM `tbl_users`
WHERE `username` = 'kepala_herman'
 LIMIT 1

    public function dashboard()
    {
        // Ambil data untuk ditampilkan di dashboard
        $data = [
            'title' => 'Dashboard',
            'user_login' => $this->session->get(),
            'total_karyawan' => $this->KaryawanModel->countAll(),
            'total_kak' => $this->KerangkaKerjaModel->countAll(),
            'total_kak_berjalan' => $this->KerangkaKerjaModel->countKakBerjalan(),
            'total_kak_selesai' => $this->KerangkaKerjaModel->countKakSelesai(),
            'statusKegiatan' => $this->KerangkaKerjaModel->statusKegiatan(),
            'jumlahPaguAnggaran' => $this->PaguAnggaranModel->getPaguAnggaran(date('Y')) ?? 0,
            'jumlahAnggaranDigunakan' => $this->LpjModel->jumlahAnggaranDigunakan()['anggaran_digunakan'],
            'jumlahAnggaranSetuju' => $this->KerangkaKerjaModel->anggaranSetuju()['anggaran_disetujui'],
            'jumlahKegiatanUnitEKKM' => $this->KerangkaKerjaModel->getKerjangkaKerjaUnit('Esensial dan Keperawatan Kesehatan Masyarakat'),
            'jumlahKegiatanUnitPengembangan' => $this->KerangkaKerjaModel->getKerjangkaKerjaUnit('Pengembangan'),
            'jumlahKegiatanUnitKL' => $this->KerangkaKerjaModel->getKerjangkaKerjaUnit('Kefarmasian & Laboratorium'),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `tbl_karyawan`
SELECT COUNT(*) AS `numrows` FROM `tbl_kerangka_kerja`

    public function kinerjaUnit()
    {
        // Hitung persentase KAK yang selesai
        $total_kak = $this->KerangkaKerjaModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kerangka_kerja`