app/Models/KerangkaKerjaModel.php

SELECT `tbl_kerangka_kerja`.*, `tbl_karyawan`.`nama_karyawan`, `tbl_karyawan`.`unit_kerja`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `id_kak` = '2'
 LIMIT 1
---
    public function getKerjangkaKerjaById($id)
    {
        return $this->select('tbl_kerangka_kerja.*, tbl_karyawan.nama_karyawan, tbl_karyawan.unit_kerja')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('id_kak', $id)
            ->first();

SELECT `tbl_kerangka_kerja`.`id_kak`, `tbl_kerangka_kerja`.`nama_kegiatan`, `tbl_kerangka_kerja`.`tanggal_mulai`, `tbl_kerangka_kerja`.`tanggal_selesai`, `tbl_karyawan`.`nama_karyawan`, `tbl_karyawan`.`unit_kerja`, `tbl_kerangka_kerja`.`status`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `status` = 'Diterima'
OR `status` = 'Menunggu Persetujuan LPJ'
OR `status` = 'Perlu Perbaikan LPJ'
ORDER BY `tbl_kerangka_kerja`.`created_at` ASC
---
    public function getKerjangkaKerjaLpj()
    {
        return $this->select('tbl_kerangka_kerja.id_kak, tbl_kerangka_kerja.nama_kegiatan, tbl_kerangka_kerja.tanggal_mulai,tbl_kerangka_kerja.tanggal_selesai, tbl_karyawan.nama_karyawan, tbl_karyawan.unit_kerja, tbl_kerangka_kerja.status')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('status', "Diterima")
            ->orWhere("status", "Menunggu Persetujuan LPJ")
            ->orWhere("status", "Perlu Perbaikan LPJ")
            ->orderBy("tbl_kerangka_kerja.created_at", "asc")
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kerangka_kerja`
WHERE `status` = 'Diterima'
OR `status` = 'Menunggu Persetujuan LPJ'
OR `status` = 'Perlu Perbaikan LPJ'
---
    public function countKakSelesai()
    {
        return $this->where('status', "Selesai")
            ->countAllResults();

SELECT MONTH(created_at) AS bulan, COUNT(*) AS total_kak
FROM `tbl_kerangka_kerja`
WHERE YEAR(created_at) = '2025'
AND `status` = 'Diproses'
OR `status` = 'Perlu Perbaikan KAK'
GROUP BY MONTH(created_at)
---
    public function statusKegiatan()
    {
        return $this->select('nama_kegiatan, status, created_at')
            ->orderBy('created_at', 'asc')
            ->limit(5)
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `tbl_karyawan`.`unit_kerja` = 'Esensial dan Keperawatan Kesehatan Masyarakat'
---
    public function getKerjangkaKerjaUnit($unit): int|string
    {
        return $this->select('tbl_karyawan.unit_kerja, COUNT(tbl_kerangka_kerja.id_kak) as jumlah_kegiatan')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('tbl_karyawan.unit_kerja', $unit)
            ->countAllResults();

SELECT MONTH(created_at) AS bulan, COUNT(*) AS total_lpj
FROM `tbl_kerangka_kerja`
WHERE YEAR(created_at) = '2025'
AND `status` = 'Diterima'
OR `status` = 'Menunggu Persetujuan LPJ'
OR `status` = 'Perlu Perbaikan LPJ'
OR `status` = 'LPJ Ditolak'
GROUP BY MONTH(created_at)
---
    public function getKakCountByMonth($year)
    {
        return $this->select("MONTH(created_at) AS bulan, COUNT(*) AS total_kak")
            ->where("YEAR(created_at)", $year)
            ->where("status", "Diproses")
            ->orWhere("status", "Perlu Perbaikan KAK")
            ->groupBy("MONTH(created_at)")
            ->findAll();

SELECT MONTH(tbl_lpj.lpj_selesai) AS bulan, COUNT(*) AS total_lpj_selesai
FROM `tbl_kerangka_kerja`
JOIN `tbl_lpj` ON `tbl_kerangka_kerja`.`id_kak` = `tbl_lpj`.`id_kak`
WHERE YEAR(tbl_lpj.lpj_selesai) = '2025'
AND `tbl_kerangka_kerja`.`status` = 'Selesai'
GROUP BY MONTH(tbl_lpj.lpj_selesai)
---
    public function getKakSelesaiByMonth($year)
    {
        return $this->select("MONTH(tbl_lpj.lpj_selesai) AS bulan, COUNT(*) AS total_lpj_selesai")
            ->join('tbl_lpj', 'tbl_kerangka_kerja.id_kak = tbl_lpj.id_kak')
            ->where("YEAR(tbl_lpj.lpj_selesai)", $year)
            ->where("tbl_kerangka_kerja.status", "Selesai")
            ->groupBy("MONTH(tbl_lpj.lpj_selesai)")
            ->findAll();